{
  "title": "Pillar Cluster Pages",
  "description": "Build 12 cluster pages (3 per pillar) with deep-dive content on specific services",
  "reference": "/docs/pillar-pages-research.md",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create egocentric-video layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for egocentric video data collection page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/acquire/egocentric-video/layout.tsx",
        "Title: 'Egocentric Video Data Collection for AI | Claru' (under 60 chars)",
        "Description about first-person video capture, wearable cameras, embodied AI training",
        "Keywords: egocentric video, first-person video data, embodied AI training, POV data collection",
        "Canonical: /pillars/acquire/egocentric-video",
        "JSON-LD: Service schema + BreadcrumbList (Home > Acquire > Egocentric Video) + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Create egocentric-video page.tsx",
      "description": "Create full cluster page for egocentric video data collection services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/acquire/egocentric-video/page.tsx",
        "Hero: Breadcrumb to /pillars/acquire, headline about first-person video capture",
        "Problem: Why egocentric video is critical for robotics/embodied AI",
        "How It Works: Wearable cameras, expert collectors, environment coverage, annotation pipeline",
        "Technical Specs: Resolution, frame rates, sensor fusion, metadata capture",
        "Use Cases: Robotics manipulation, autonomous navigation, AR/VR training",
        "Research to cite: Ego4D dataset, EPIC-KITCHENS, Open X-Embodiment",
        "FAQ: 3 questions about collection methodology, scale, privacy",
        "CTA: Back to Acquire pillar + consultation",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Research Ego4D, EPIC-KITCHENS datasets for scale examples"
    },
    {
      "id": "US-003",
      "title": "Create synthetic-data layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for synthetic data generation page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/acquire/synthetic-data/layout.tsx",
        "Title: 'Synthetic Data Generation for AI Training | Claru' (under 60 chars)",
        "Description about Unreal Engine, procedural generation, domain randomization",
        "Keywords: synthetic data generation, AI training data, Unreal Engine data, procedural data",
        "Canonical: /pillars/acquire/synthetic-data",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Create synthetic-data page.tsx",
      "description": "Create full cluster page for synthetic data generation services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/acquire/synthetic-data/page.tsx",
        "Hero: Breadcrumb, headline about generating training data that doesn't exist",
        "Problem: Real data is scarce, expensive, biased - synthetic fills gaps",
        "How It Works: Unreal Engine pipelines, domain randomization, human validation layer",
        "Technical Specs: Photorealism levels, variation parameters, ground truth labels",
        "Use Cases: Autonomous vehicles, robotics sim-to-real, rare event training",
        "Research to cite: Gartner 80% synthetic by 2028, NVIDIA Omniverse, domain randomization",
        "FAQ: 3 questions about realism, validation, sim-to-real gap",
        "Cross-link to data-licensing",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Research Gartner synthetic data predictions, NVIDIA Omniverse"
    },
    {
      "id": "US-005",
      "title": "Create data-licensing layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for data licensing page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/acquire/data-licensing/layout.tsx",
        "Title: 'AI Training Data Licensing Services | Claru' (under 60 chars)",
        "Description about licensed content, copyright compliance, provenance documentation",
        "Keywords: AI data licensing, training data rights, licensed datasets, copyright compliant AI data",
        "Canonical: /pillars/acquire/data-licensing",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Create data-licensing page.tsx",
      "description": "Create full cluster page for data licensing and rights management services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/acquire/data-licensing/page.tsx",
        "Hero: Breadcrumb, headline about legal, licensed training data",
        "Problem: Copyright lawsuits, NYT v OpenAI, provenance requirements, EU AI Act",
        "How It Works: Content partnerships, rights negotiation, provenance tracking, audit trails",
        "Technical Specs: License types, attribution requirements, geographic rights",
        "Use Cases: Media companies, enterprise AI, regulated industries",
        "Research to cite: NYT lawsuit, Getty v Stability, EU AI Act transparency requirements",
        "FAQ: 3 questions about copyright, licensing costs, compliance",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Research NYT v OpenAI, Getty v Stability AI lawsuits"
    },
    {
      "id": "US-007",
      "title": "Create deduplication layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for deduplication services page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/prepare/deduplication/layout.tsx",
        "Title: 'AI Training Data Deduplication Services | Claru' (under 60 chars)",
        "Description about MinHashLSH, trillion-token scale, duplicate removal",
        "Keywords: data deduplication, LLM training data, MinHashLSH, duplicate detection",
        "Canonical: /pillars/prepare/deduplication",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Create deduplication page.tsx",
      "description": "Create full cluster page for data deduplication services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/prepare/deduplication/page.tsx",
        "Hero: Breadcrumb to /pillars/prepare, headline about removing duplicates at scale",
        "Problem: Duplicates cause memorization, wasted compute, benchmark contamination",
        "How It Works: Multi-level dedup (document, paragraph, n-gram), MinHashLSH, embedding similarity",
        "Technical Specs: Trillion-token processing, configurable thresholds, near-duplicate detection",
        "Use Cases: LLM pre-training, benchmark curation, web corpus cleaning",
        "Research to cite: SlimPajama, RefinedWeb dedup methodology, ACL dedup papers",
        "FAQ: 3 questions about near-duplicates, threshold tuning, processing speed",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Research SlimPajama deduplication, RefinedWeb methodology"
    },
    {
      "id": "US-009",
      "title": "Create multimodal-alignment layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for multimodal alignment page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/prepare/multimodal-alignment/layout.tsx",
        "Title: 'Multimodal Data Alignment for AI Training | Claru' (under 60 chars)",
        "Description about video-text pairing, cross-modal synchronization, temporal alignment",
        "Keywords: multimodal alignment, video-text pairing, cross-modal data, temporal synchronization",
        "Canonical: /pillars/prepare/multimodal-alignment",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 9,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Create multimodal-alignment page.tsx",
      "description": "Create full cluster page for multimodal data alignment services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/prepare/multimodal-alignment/page.tsx",
        "Hero: Breadcrumb, headline about synchronizing data across modalities",
        "Problem: Video-text misalignment, audio drift, frame-caption mismatch breaks training",
        "How It Works: Temporal alignment, cross-modal embedding, automated QA, human verification",
        "Technical Specs: Frame-level precision, audio sync tolerance, caption density",
        "Use Cases: Video-language models, text-to-video, vision-language pre-training",
        "Research to cite: CLIP alignment, InternVideo, TALC time-aligned captions",
        "FAQ: 3 questions about alignment accuracy, handling drift, quality metrics",
        "Cross-link to quality-scoring",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Research CLIP, InternVideo, TALC datasets"
    },
    {
      "id": "US-011",
      "title": "Create quality-scoring layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for quality scoring page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/prepare/quality-scoring/layout.tsx",
        "Title: 'ML Data Quality Scoring & Filtering | Claru' (under 60 chars)",
        "Description about quality classifiers, perplexity filtering, semantic scoring",
        "Keywords: data quality scoring, ML data filtering, training data quality, perplexity filtering",
        "Canonical: /pillars/prepare/quality-scoring",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 11,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-012",
      "title": "Create quality-scoring page.tsx",
      "description": "Create full cluster page for data quality scoring and filtering services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/prepare/quality-scoring/page.tsx",
        "Hero: Breadcrumb, headline about separating signal from noise",
        "Problem: 10-1000x data reduction needed, but aggressive filtering loses diversity",
        "How It Works: Multi-signal scoring (perplexity, classifier, embedding), configurable thresholds",
        "Technical Specs: Scoring dimensions, threshold calibration, diversity preservation",
        "Use Cases: Web corpus filtering, instruction tuning data, domain-specific corpora",
        "Research to cite: RefinedWeb filtering, FineWeb, quality classifier papers",
        "FAQ: 3 questions about threshold selection, diversity vs quality, domain adaptation",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 12,
      "passes": true,
      "notes": "Research RefinedWeb, FineWeb quality filtering"
    },
    {
      "id": "US-013",
      "title": "Create rlhf layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for RLHF services page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/enrich/rlhf/layout.tsx",
        "Title: 'RLHF Data Services for LLM Alignment | Claru' (under 60 chars)",
        "Description about preference ranking, reward modeling, human feedback at scale",
        "Keywords: RLHF services, preference data, human feedback AI, reward model training",
        "Canonical: /pillars/enrich/rlhf",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 13,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-014",
      "title": "Create rlhf page.tsx",
      "description": "Create full cluster page for RLHF and preference data services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/enrich/rlhf/page.tsx",
        "Hero: Breadcrumb to /pillars/enrich, headline about human judgment for AI alignment",
        "Problem: RLHF quality determines model behavior ceiling, crowdsourced feedback is noisy",
        "How It Works: Expert rankers, preference collection, reward model training support, iterative refinement",
        "Technical Specs: Comparison formats (pairwise, ranked lists), IAA targets, throughput",
        "Use Cases: LLM fine-tuning, constitutional AI, chat model alignment",
        "Research to cite: InstructGPT, Anthropic RLHF, RLTHF efficiency paper",
        "FAQ: 3 questions about expert vs crowd, scale, iteration cycles",
        "Cross-link to expert-annotation",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 14,
      "passes": true,
      "notes": "Research InstructGPT, Anthropic RLHF papers"
    },
    {
      "id": "US-015",
      "title": "Create video-annotation layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for video annotation page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/enrich/video-annotation/layout.tsx",
        "Title: 'Frame-Level Video Annotation Services | Claru' (under 60 chars)",
        "Description about temporal segmentation, action recognition, object tracking",
        "Keywords: video annotation, frame-level labeling, temporal annotation, video AI training",
        "Canonical: /pillars/enrich/video-annotation",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 15,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-016",
      "title": "Create video-annotation page.tsx",
      "description": "Create full cluster page for video annotation services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/enrich/video-annotation/page.tsx",
        "Hero: Breadcrumb, headline about frame-by-frame precision",
        "Problem: 10 minutes of video = 18,000 frames, temporal consistency is hard",
        "How It Works: Keyframe annotation, interpolation, temporal consistency QA, action segmentation",
        "Technical Specs: Frame density, annotation types (bbox, segmentation, skeleton), temporal linking",
        "Use Cases: Video generation models, autonomous vehicles, sports analytics",
        "Research to cite: Video annotation bottleneck stats, SAM2, temporal annotation research",
        "FAQ: 3 questions about annotation density, temporal consistency, turnaround time",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 16,
      "passes": true,
      "notes": "Research SAM2, video annotation benchmarks"
    },
    {
      "id": "US-017",
      "title": "Create expert-annotation layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for expert annotation page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/enrich/expert-annotation/layout.tsx",
        "Title: 'Expert Domain Annotation for AI Training | Claru' (under 60 chars)",
        "Description about PhD-level annotators, STEM specialists, domain expertise",
        "Keywords: expert annotation, domain specialist labeling, PhD annotators, specialized AI training",
        "Canonical: /pillars/enrich/expert-annotation",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 17,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-018",
      "title": "Create expert-annotation page.tsx",
      "description": "Create full cluster page for expert domain annotation services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/enrich/expert-annotation/page.tsx",
        "Hero: Breadcrumb, headline about domain experts, not crowds",
        "Problem: Generic annotators miss nuance, STEM/medical/legal requires credentials",
        "How It Works: Expert recruitment, credential verification, domain matching, specialized tooling",
        "Technical Specs: Annotator qualification levels, domain coverage, quality metrics",
        "Use Cases: Medical AI, legal document analysis, scientific research, code review",
        "Research to cite: Expert vs crowdsourced accuracy studies, xAI specialist pivot",
        "FAQ: 3 questions about finding experts, quality assurance, domain coverage",
        "Cross-link to rlhf",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 18,
      "passes": true,
      "notes": "Research xAI pivot to specialists, expert annotation studies"
    },
    {
      "id": "US-019",
      "title": "Create red-teaming layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for red teaming page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/validate/red-teaming/layout.tsx",
        "Title: 'AI Red Teaming & Adversarial Testing | Claru' (under 60 chars)",
        "Description about jailbreak testing, safety evaluation, vulnerability discovery",
        "Keywords: AI red teaming, adversarial testing, LLM jailbreak testing, AI safety evaluation",
        "Canonical: /pillars/validate/red-teaming",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 19,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-020",
      "title": "Create red-teaming page.tsx",
      "description": "Create full cluster page for AI red teaming services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/validate/red-teaming/page.tsx",
        "Hero: Breadcrumb to /pillars/validate, headline about finding vulnerabilities before users do",
        "Problem: Jailbreaks evolve constantly, automated testing misses creative attacks",
        "How It Works: Threat modeling, attack taxonomy, human red teamers, severity scoring, remediation",
        "Technical Specs: Attack categories, testing coverage, reporting format",
        "Use Cases: Pre-deployment safety, compliance (EU AI Act), ongoing monitoring",
        "Research to cite: CSET red teaming guide, Anthropic safety research, NIST AI RMF",
        "FAQ: 3 questions about methodology, coverage, remediation support",
        "Cross-link to benchmark-curation",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 20,
      "passes": true,
      "notes": "Research CSET, NIST AI RMF, Anthropic safety"
    },
    {
      "id": "US-021",
      "title": "Create benchmark-curation layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for benchmark curation page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/validate/benchmark-curation/layout.tsx",
        "Title: 'AI Benchmark & Golden Dataset Curation | Claru' (under 60 chars)",
        "Description about evaluation set creation, contamination-free benchmarks, ground truth",
        "Keywords: AI benchmark curation, golden datasets, evaluation sets, benchmark contamination",
        "Canonical: /pillars/validate/benchmark-curation",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 21,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-022",
      "title": "Create benchmark-curation page.tsx",
      "description": "Create full cluster page for benchmark and golden dataset curation services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/validate/benchmark-curation/page.tsx",
        "Hero: Breadcrumb, headline about trusted evaluation data",
        "Problem: Benchmark contamination, data leakage, gaming metrics without real improvement",
        "How It Works: Fresh data collection, contamination testing, expert validation, versioning",
        "Technical Specs: Contamination detection methods, update frequency, coverage metrics",
        "Use Cases: Model evaluation, capability testing, progress tracking, regulatory compliance",
        "Research to cite: Benchmark contamination papers, HELM, eval best practices",
        "FAQ: 3 questions about contamination, refresh cycles, custom benchmarks",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 22,
      "passes": true,
      "notes": "Research HELM, benchmark contamination studies"
    },
    {
      "id": "US-023",
      "title": "Create bias-detection layout.tsx",
      "description": "Create layout with metadata and JSON-LD schema for bias detection page.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/validate/bias-detection/layout.tsx",
        "Title: 'AI Bias Detection & Fairness Evaluation | Claru' (under 60 chars)",
        "Description about systematic bias analysis, fairness testing, representation audits",
        "Keywords: AI bias detection, fairness evaluation, ML bias testing, representation analysis",
        "Canonical: /pillars/validate/bias-detection",
        "JSON-LD: Service + BreadcrumbList + FAQPage (3 questions)",
        "Typecheck passes"
      ],
      "priority": 23,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-024",
      "title": "Create bias-detection page.tsx",
      "description": "Create full cluster page for bias detection and fairness evaluation services.",
      "acceptanceCriteria": [
        "Create /src/app/pillars/validate/bias-detection/page.tsx",
        "Hero: Breadcrumb, headline about finding systematic errors before they compound",
        "Problem: Bias in training data compounds in model outputs, regulatory scrutiny increasing",
        "How It Works: Representation analysis, systematic error detection, subgroup testing, remediation",
        "Technical Specs: Bias dimensions, testing frameworks, metrics (demographic parity, etc.)",
        "Use Cases: Hiring AI, lending models, content moderation, healthcare AI",
        "Research to cite: AI fairness research, EU AI Act high-risk requirements, bias audit frameworks",
        "FAQ: 3 questions about bias types, remediation, ongoing monitoring",
        "Cross-link to red-teaming",
        "1,000-2,000 words, 3-5 citations",
        "Typecheck passes"
      ],
      "priority": 24,
      "passes": true,
      "notes": "Research EU AI Act, fairness metrics, bias audits"
    },
    {
      "id": "US-025",
      "title": "Update pillar pages with cluster links",
      "description": "Add internal links from each pillar page to its cluster pages.",
      "acceptanceCriteria": [
        "Each pillar page links to all 3 of its cluster pages",
        "Links appear in capabilities section or dedicated 'Deep Dive' section",
        "Breadcrumb navigation works correctly",
        "All internal links use Next.js Link component",
        "Typecheck passes"
      ],
      "priority": 25,
      "passes": false,
      "notes": "Update acquire, prepare, enrich, validate pages"
    },
    {
      "id": "US-026",
      "title": "Final build verification",
      "description": "Verify all 12 cluster pages build correctly.",
      "acceptanceCriteria": [
        "npm run build passes with no errors",
        "All 12 cluster pages appear in build output as static pages",
        "No TypeScript errors or warnings",
        "All Citation hrefs are valid URLs",
        "Cross-links between pages work correctly"
      ],
      "priority": 26,
      "passes": false,
      "notes": "Final verification before merge"
    }
  ]
}
